Revit 2027 API
ColumnAttachment.CutStyle Property
 Identifies whether the column, or the attached element should be cut (or if neither should be cut).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ColumnAttachmentCutStyle CutStyle { get; }
Public ReadOnly Property CutStyle As ColumnAttachmentCutStyle
	Get
public:
property ColumnAttachmentCutStyle CutStyle {
	ColumnAttachmentCutStyle get ();
}
member CutStyle : ColumnAttachmentCutStyle with get
Property Value
ColumnAttachmentCutStyle
See Also
Reference
ColumnAttachment Class
Autodesk.Revit.DB Namespace